carloscn/s32k344_rtd/BaseNXP_TS_T40D34M30I0R0/header/S32M27x_AEC_AE.h
#define AEC_AE_LINPHY_CFG_SLEW_MASK              (0x30U)
#define AEC_AE_LINPHY_CFG_SLEW_SHIFT             (4U)
#define AEC_AE_LINPHY_CFG_SLEW_WIDTH             (2U)
#define AEC_AE_LINPHY_CFG_SLEW(x)                (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_SLEW_SHIFT)) & AEC_AE_LINPHY_CFG_SLEW_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_NSLP_MASK         (0x100U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP_SHIFT        (8U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP_WIDTH        (1U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP(x)           (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_NSLP_SHIFT)) & AEC_AE_LINPHY_CFG_CXPI_NSLP_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_MS_MASK           (0x200U)
#define AEC_AE_LINPHY_CFG_CXPI_MS_SHIFT          (9U)
#define AEC_AE_LINPHY_CFG_CXPI_MS_WIDTH          (1U)
#define AEC_AE_LINPHY_CFG_CXPI_MS(x)             (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_MS_SHIFT)) & AEC_AE_LINPHY_CFG_CXPI_MS_MASK)

#define AEC_AE_LINPHY_CFG_LINPHY_ENABLE_MASK     (0x8000U)
#define AEC_AE_LINPHY_CFG_LINPHY_ENABLE_SHIFT    (15U)
#define AEC_AE_LINPHY_CFG_LINPHY_ENABLE_WIDTH    (1U)
#define AEC_AE_LINPHY_CFG_LINPHY_ENABLE(x)       (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_LINPHY_ENABLE_SHIFT)) & AEC_AE_LINPHY_CFG_LINPHY_ENABLE_MASK)
/*! @} */

/*! @name LINPHY_MONITOR - LINPHY Monitor */
/*! @{ */

#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_MASK (0x1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_SHIFT (0U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL(x)  (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_MASK (0x2U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_SHIFT (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_MASK (0x4U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_SHIFT (2U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_MASK (0x8U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_SHIFT (3U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_MASK (0x10U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_SHIFT (4U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_MASK (0x20U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_SHIFT (5U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_MASK (0x40U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_SHIFT (6U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_MASK (0x80U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_SHIFT (7U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_MASK (0x100U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_SHIFT (8U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN(x)  (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_MASK (0x200U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_SHIFT (9U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_MASK (0x400U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_SHIFT (10U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_MASK (0x800U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_SHIFT (11U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN(x) (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_MASK)
/*! @} */

/*! @name CANPHY_CFG - CANPHY Configuration */
/*! @{ */

#define AEC_AE_CANPHY_CFG_MODE_MASK              (0x3U)
#define AEC_AE_CANPHY_CFG_MODE_SHIFT             (0U)
#define AEC_AE_CANPHY_CFG_MODE_WIDTH             (2U)
#define AEC_AE_CANPHY_CFG_MODE(x)                (((uint16_t)(((uint16_t)(x)) << AEC_AE_CANPHY_CFG_MODE_SHIFT)) & AEC_AE_CANPHY_CFG_MODE_MASK)

